Revit 2026 API

# DocumentGetElement(String) Method

---

Gets the Element referenced by a unique id string.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element GetElement(
	string uniqueId
)
```
```vb
Public Function GetElement (
	uniqueId As String
) As Element
```
```cpp
public:
Element^ GetElement(
	String^ uniqueId
)
```
```fsharp
member GetElement :
        uniqueId : string -> Element
```

#### Parameters

uniqueId String
     The element unique id, whose referenced Element will be retrieved from the model.
* UniqueId

#### Return Value

Element The element referenced by the input argument.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

will be returned if the input id string doesn't reference to a valid Element.

#### Reference

Document Class

GetElement Overload

Autodesk.Revit.DB Namespace